content/posts/Docker-MySQL-Canal.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-10-09 Sun 18:23 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Luke Yao" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="https://tecosaur.com/resources/org/nib.ico" type="image/ico" />

<!-- HTML -->
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/firacode@6.2.0/distr/fira_code.css">
<link rel="stylesheet" href="/ox-html.css">
</head>
<body>
<input type='checkbox' id='theme-switch'><div id='page'><label id='switch-label' for='theme-switch'></label><div id="content">
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#docker-mysql-canal">1. Docker MySQL Canal</a>
<ul>
<li><a href="#org0a42a5d">1.1. 创建 docker network</a></li>
<li><a href="#org845d131">1.2. 镜像准备</a></li>
<li><a href="#org67c178e">1.3. 容器拉起</a></li>
<li><a href="#orgfda420d">1.4. MySQL的配置修改</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
三月中, 同事即将离职, 在他离职后要接手实时流的相关工作, 所以先有了这篇.
</p>

<div id="outline-container-docker-mysql-canal" class="outline-2">
<h2 id="docker-mysql-canal"><span class="section-number-2">1.</span> Docker MySQL Canal</h2>
<div class="outline-text-2" id="text-docker-mysql-canal">
</div>

<div id="outline-container-org0a42a5d" class="outline-3">
<h3 id="org0a42a5d"><span class="section-number-3">1.1.</span> 创建 docker network</h3>
<div class="outline-text-3" id="text-1-1">
<details id='orgb8a1297' class='code' open><summary><span class="lang">shell</span></summary>
        <div class='gutter'>
        <a href='#orgb8a1297'>#</a>
        <button title='Copy to clipboard' onclick='copyPreToClipbord(this)'>⎘</button>        </div>
        <div class="org-src-container">
<pre class="src src-sh">docker network create --subnet=172.18.0.0/16 mynetwork
<span class="org-comment-delimiter"># </span><span class="org-comment">172.17.0.0/16 has been used as default network</span>
</pre>
</div>
        </details>
</div>
</div>

<div id="outline-container-org845d131" class="outline-3">
<h3 id="org845d131"><span class="section-number-3">1.2.</span> 镜像准备</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>docker desktop for Mac &gt; Preferences &gt; Docker Engine &gt; 配置 docker 镜像</li>
<li>使用命令 <code>docker pull canal/canal-server</code> 拉取 canal-server 镜像</li>
<li>使用命令 <code>docker pull mysql</code> 拉取 mysql 镜像</li>
<li>使用命令 <code>docker pull canal/canal-admin</code> 拉取 canal-admin 镜像</li>
</ol>
</div>
</div>

<div id="outline-container-org67c178e" class="outline-3">
<h3 id="org67c178e"><span class="section-number-3">1.3.</span> 容器拉起</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li><p>
MySQL - 33306
</p>

<details id='org03c806a' class='code' open><summary><span class="lang">shell</span></summary>
        <div class='gutter'>
        <a href='#org03c806a'>#</a>
        <button title='Copy to clipboard' onclick='copyPreToClipbord(this)'>⎘</button>        </div>
        <div class="org-src-container">
<pre class="src src-sh">docker run -d --name mysql --net mynetwork --ip 172.18.0.6 -p 3306:3306 -e <span class="org-variable-name">MYSQL_ROOT_PASSWORD</span>=root mysql
</pre>
</div>
        </details></li>

<li><p>
Canal-Server
</p>

<details id='orgdaf1239' class='code' open><summary><span class="lang">shell</span></summary>
        <div class='gutter'>
        <a href='#orgdaf1239'>#</a>
        <button title='Copy to clipboard' onclick='copyPreToClipbord(this)'>⎘</button>        </div>
        <div class="org-src-container">
<pre class="src src-sh">docker run -d --name canal-server --net mynetwork --ip 172.18.0.9 -p 11111:11111 canal/canal-server
</pre>
</div>
        </details></li>
</ol>
</div>
</div>

<div id="outline-container-orgfda420d" class="outline-3">
<h3 id="orgfda420d"><span class="section-number-3">1.4.</span> MySQL的配置修改</h3>
<div class="outline-text-3" id="text-1-4">
<p>
以上只是初步准备好了基础的环境, 但是怎么让canal伪装成salve并正确获取mysql中的binary log呢？
</p>

<p>
对于自建 MySQL , 需要先开启 <code>Binlog</code> 写入功能, 配置 <code>binlog-format</code> 为 ROW 模式, 通过修改mysql配置文件来开启 bin_log, 使用 <code>find / -name my.cnf</code> 查找 <code>my.cnf</code>, 修改文件内容如下
</p>

<details id='orga4f1420' class='code' open><summary><span class="lang">shell</span></summary>
        <div class='gutter'>
        <a href='#orga4f1420'>#</a>
        <button title='Copy to clipboard' onclick='copyPreToClipbord(this)'>⎘</button>        </div>
        <div class="org-src-container">
<pre class="src src-sh"><span class="org-rainbow-delimiters-depth-1">[</span>mysqld<span class="org-rainbow-delimiters-depth-1">]</span>
log-bin=mysql-bin <span class="org-comment-delimiter"># </span><span class="org-comment">&#24320;&#21551; binlog</span>
binlog-format=ROW <span class="org-comment-delimiter"># </span><span class="org-comment">&#36873;&#25321; ROW &#27169;&#24335;</span>
<span class="org-variable-name">server_id</span>=<span class="org-highlight-numbers-number">1</span>       <span class="org-comment-delimiter"># </span><span class="org-comment">&#37197;&#32622; MySQL replaction &#38656;&#35201;&#23450;&#20041;, &#19981;&#35201;&#21644; canal &#30340; slaveId &#37325;&#22797;</span>
</pre>
</div>
        </details>

<p>
进入 MySQL 容器, 创建账户 canal 并授于相关权限
</p>

<details id='org67a2c17' class='code' open><summary><span class="lang">shell</span></summary>
        <div class='gutter'>
        <a href='#org67a2c17'>#</a>
        <button title='Copy to clipboard' onclick='copyPreToClipbord(this)'>⎘</button>        </div>
        <div class="org-src-container">
<pre class="src src-sh">$ docker exec -it mysql /bin/bash
...
<span class="org-comment-delimiter"># </span><span class="org-comment">mysql -uroot -proot</span>
...
mysql&gt; CREATE USER canal IDENTIFIED BY <span class="org-string">'canal'</span>;
Query OK, <span class="org-highlight-numbers-number">0</span> rows affected <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-highlight-numbers-number">0.01</span> sec<span class="org-rainbow-delimiters-depth-1">)</span>

mysql&gt; GRANT SELECT, REPLICATION SLAVE, REPLICATION CLIENT ON *.* TO <span class="org-string">'canal'</span>@<span class="org-string">'%'</span>;
Query OK, <span class="org-highlight-numbers-number">0</span> rows affected <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-highlight-numbers-number">0.00</span> sec<span class="org-rainbow-delimiters-depth-1">)</span>

mysql&gt; -- GRANT ALL PRIVILEGES ON *.* TO <span class="org-string">'canal'</span>@<span class="org-string">'%'</span> ;
mysql&gt; FLUSH PRIVILEGES;
Query OK, <span class="org-highlight-numbers-number">0</span> rows affected <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-highlight-numbers-number">0.00</span> sec<span class="org-rainbow-delimiters-depth-1">)</span>

mysql&gt;
</pre>
</div>
        </details>

<p>
验证: 
</p>

<details id='org098efe3' class='code' open><summary><span class="lang">shell</span></summary>
        <div class='gutter'>
        <a href='#org098efe3'>#</a>
        <button title='Copy to clipboard' onclick='copyPreToClipbord(this)'>⎘</button>        </div>
        <div class="org-src-container">
<pre class="src src-sh">mysql&gt; show variables like <span class="org-string">'log_bin'</span>;
+---------------+-------+
| Variable_name | Value |
+---------------+-------+
| log_bin       | ON    |
+---------------+-------+
<span class="org-highlight-numbers-number">1</span> row<span class="org-keyword"> in</span> set <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-highlight-numbers-number">0.00</span> sec<span class="org-rainbow-delimiters-depth-1">)</span>

mysql&gt; show variables like <span class="org-string">'binlog_format'</span>;
+---------------+-------+
| Variable_name | Value |
+---------------+-------+
| binlog_format | ROW   |
+---------------+-------+
<span class="org-highlight-numbers-number">1</span> row<span class="org-keyword"> in</span> set <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-highlight-numbers-number">0.00</span> sec<span class="org-rainbow-delimiters-depth-1">)</span>

mysql&gt; show master status;
+------------------+----------+--------------+------------------+-------------------+
| File             | Position | Binlog_Do_DB | Binlog_Ignore_DB | Executed_Gtid_Set |
+------------------+----------+--------------+------------------+-------------------+
| mysql-bin.000001 |      <span class="org-highlight-numbers-number">156</span> |              |                  |                   |
+------------------+----------+--------------+------------------+-------------------+
<span class="org-highlight-numbers-number">1</span> row<span class="org-keyword"> in</span> set <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-highlight-numbers-number">0.00</span> sec<span class="org-rainbow-delimiters-depth-1">)</span>

mysql&gt;
</pre>
</div>
        </details>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luke Yao</p>
<p class="date">Created: 2022-10-09 Sun 18:23</p>
</div>
</div>
</body>
</html>
